RT-Thread/realboard-lpc4088/software/rtthread_examples/drivers/usbhw.c
/*----------------------------------------------------------------------------
 *      U S B  -  K e r n e l
 *----------------------------------------------------------------------------
 * Name:    usbhw.c
 * Purpose: USB Hardware Layer Module for NXP's LPC17xx MCU
 * Version: V1.20
 *----------------------------------------------------------------------------
 *      This software is supplied "AS IS" without any warranties, express,
 *      implied or statutory, including but not limited to the implied
 *      warranties of fitness for purpose, satisfactory quality and
 *      noninfringement. Keil extends you a royalty-free right to reproduce
 *      and distribute executable files created using this software for use
 *      on NXP Semiconductors LPC family microcontroller devices only. Nothing
 *      else gives you the right to use this software.
 *
 * Copyright (c) 2009 Keil - An ARM Company. All rights reserved.
 *----------------------------------------------------------------------------
 * History:
 *          V1.20 Added USB_ClearEPBuf
 *          V1.00 Initial Version
 *----------------------------------------------------------------------------*/
#include <rtthread.h>
#include <drivers/usb_device.h>

#ifdef __BUILD_WITH_EXAMPLE__
#include "lpc_libcfg.h"
#else
#include "lpc_libcfg_default.h"
#endif /* __BUILD_WITH_EXAMPLE__ */

#ifdef _USB_DEV_MASS_STORAGE
#include "LPC407x_8x_177x_8x.h"                        /* LPC407x_8x_177x_8x.h definitions */
#include "usb.h"
#include "usbcfg.h"
#include "usbreg.h"
#include "usbhw.h"
#include "usbuser.h"
#include "lpc_types.h"


/** @addtogroup USBDEV_MscUsbHw
 * @{
 */

#if defined   (  __IAR_SYSTEMS_ICC__  )
#pragma language=save
#pragma language=extended
#endif

#define EP_MSK_CTRL 0x0001      /* Control Endpoint Logical Address Mask */
#define EP_MSK_BULK 0xC924      /* Bulk Endpoint Logical Address Mask */
#define EP_MSK_INT  0x4492      /* Interrupt Endpoint Logical Address Mask */
#define EP_MSK_ISO  0x1248      /* Isochronous Endpoint Logical Address Mask */

#define _CURR_USING_BRD 1

#if USB_DMA

#if defined (__CC_ARM)
#pragma arm section zidata = "USB_RAM"
uint32_t UDCA[USB_EP_NUM];                     /* UDCA in USB RAM */

uint32_t DD_NISO_Mem[4 * DD_NISO_CNT];         /* Non-Iso DMA Descriptor Memory */
uint32_t DD_ISO_Mem [5 * DD_ISO_CNT];          /* Iso DMA Descriptor Memory */
#pragma arm section zidata
#elif defined ( __ICCARM__ )
#pragma location = "USB_RAM"
uint32_t UDCA[USB_EP_NUM];                     /* UDCA in USB RAM */
#pragma location = "USB_RAM"
uint32_t DD_NISO_Mem[4 * DD_NISO_CNT];         /* Non-Iso DMA Descriptor Memory */
#pragma location = "USB_RAM"
uint32_t DD_ISO_Mem [5 * DD_ISO_CNT];          /* Iso DMA Descriptor Memory */

#else
uint32_t UDCA[USB_EP_NUM]__attribute__((section("USB_RAM")));                      /* UDCA in USB RAM */

uint32_t DD_NISO_Mem[4 * DD_NISO_CNT]__attribute__((section("USB_RAM")));          /* Non-Iso DMA Descriptor Memory */
uint32_t DD_ISO_Mem [5 * DD_ISO_CNT]__attribute__((section("USB_RAM")));           /* Iso DMA Descriptor Memory */
#endif /*__GNUC__*/
uint32_t udca[USB_EP_NUM];                     /* UDCA saved values */

uint32_t DDMemMap[2];                          /* DMA Descriptor Memory Usage */

#endif


/*
 *  Get Endpoint Physical Address
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    Endpoint Physical Address
 */

uint32_t EPAdr(uint32_t EPNum)
{
    uint32_t val;

    val = (EPNum & 0x0F) << 1;
    if (EPNum & 0x80)
    {
        val += 1;
    }
    return (val);
}


/*
 *  Write Command
 *    Parameters:      cmd:   Command
 *    Return Value:    None
 */

void WrCmd(uint32_t cmd)
{

    LPC_USB->DevIntClr = CCEMTY_INT;
    LPC_USB->CmdCode = cmd;
    while ((LPC_USB->DevIntSt & CCEMTY_INT) == 0);
}


/*
 *  Write Command Data
 *    Parameters:      cmd:   Command
 *                     val:   Data
 *    Return Value:    None
 */

void WrCmdDat(uint32_t cmd, uint32_t val)
{

    LPC_USB->DevIntClr = CCEMTY_INT;
    LPC_USB->CmdCode = cmd;
    while ((LPC_USB->DevIntSt & CCEMTY_INT) == 0);
    LPC_USB->DevIntClr = CCEMTY_INT;
    LPC_USB->CmdCode = val;
    while ((LPC_USB->DevIntSt & CCEMTY_INT) == 0);
}


/*
 *  Write Command to Endpoint
 *    Parameters:      cmd:   Command
 *                     val:   Data
 *    Return Value:    None
 */

void WrCmdEP(uint32_t EPNum, uint32_t cmd)
{

    LPC_USB->DevIntClr = CCEMTY_INT;
    LPC_USB->CmdCode = CMD_SEL_EP(EPAdr(EPNum));
    while ((LPC_USB->DevIntSt & CCEMTY_INT) == 0);
    LPC_USB->DevIntClr = CCEMTY_INT;
    LPC_USB->CmdCode = cmd;
    while ((LPC_USB->DevIntSt & CCEMTY_INT) == 0);
}


/*
 *  Read Command Data
 *    Parameters:      cmd:   Command
 *    Return Value:    Data Value
 */

uint32_t RdCmdDat(uint32_t cmd)
{

    LPC_USB->DevIntClr = CCEMTY_INT | CDFULL_INT;
    LPC_USB->CmdCode = cmd;
    while ((LPC_USB->DevIntSt & CDFULL_INT) == 0);
    return (LPC_USB->CmdData);
}


/*
 *  USB Initialize Function
 *   Called by the User to initialize USB
 *    Return Value:    None
 */

void USB_Init(void)
{
    /* if 1, use port 1 as device, if 0, use port2 as device. */
#if  (USB_PORT == 1)
#if (_CURR_USING_BRD == _IAR_OLIMEX_BOARD)
    LPC_IOCON->P0_27 = 0x2;
    LPC_IOCON->P0_28 = 0x2;
#endif

    LPC_IOCON->P0_29 &= ~0x07;    /* P0.29 D1+, P0.30 D1- */
    LPC_IOCON->P0_29 |= 0x1;
    LPC_IOCON->P0_30 &= ~0x07;
    LPC_IOCON->P0_30 |= 0x1;

    LPC_IOCON->P2_9  &= ~0x07;    /* USB_SoftConnect */
    LPC_IOCON->P2_9  |= 0x1;

    LPC_IOCON->P1_30  &= ~0x07;   /* USB_VBUS */
    LPC_IOCON->P1_30  |= 0x2;

    LPC_IOCON->P1_18  &= ~0x07;   /* USB_LED */
    LPC_IOCON->P1_18  |= 0x1;

    LPC_SC->PCONP |= (1UL << 31);              /* USB PCLK -> enable USB Per.       */

    LPC_USB->USBClkCtrl =  0x12 | (1 << 2);             /* Dev, AHB clock enable */
    while ((LPC_USB->USBClkSt & 0x12) != 0x12);
#else
    LPC_IOCON->P0_31 &= ~0x07;    /* P0.31 D2+, D2- is dedicated pin.  */
    LPC_IOCON->P0_31 |= 0x1;

    LPC_IOCON->P0_14  &= ~0x07;    /* USB_SoftConnect */
    LPC_IOCON->P0_14  |= 0x3;

