RT-Thread/realboard-lpc4088/software/rtthread_examples/drivers/usbhw.c
    LPC_IOCON->P1_30  &= ~0x07;   /* USB_VBUS */
    LPC_IOCON->P1_30  |= 0x2;


    LPC_SC->PCONP |= (1UL << 31);              /* USB PCLK -> enable USB Per.       */

    LPC_USB->USBClkCtrl = 0x1A;                /* Dev, OTG, AHB clock enable */
    while ((LPC_USB->USBClkSt & 0x1A) != 0x1A);

    /* Port Select register when USB device is configured. */
    LPC_USB->StCtrl = 0x3;

    LPC_USB->USBClkCtrl = 0x12;                /* Disable OTG clock */
    while ((LPC_USB->USBClkSt & 0x12) != 0x12);
#endif

    NVIC_EnableIRQ(USB_IRQn);               /* enable USB interrupt */

#if (_CURR_USING_BRD == _IAR_OLIMEX_BOARD)
    LPC_USB->I2C_CTL |= (1 << 8);
    while (LPC_USB->I2C_CTL & (1 << 8));
#endif

    USB_Reset();
    USB_SetAddress(0);
}


/*
 *  USB Connect Function
 *   Called by the User to Connect/Disconnect USB
 *    Parameters:      con:   Connect/Disconnect
 *    Return Value:    None
 */

void USB_Connect(uint32_t con)
{
    WrCmdDat(CMD_SET_DEV_STAT, DAT_WR_BYTE(con ? DEV_CON : 0));
#if (_CURR_USING_BRD == _IAR_OLIMEX_BOARD)
    LPC_USB->I2C_STS |= (1 << 0);
    LPC_USB->I2C_TX = 0x15A;             // Send ISP1301 address, R/W=0
    LPC_USB->I2C_TX = 0x006;  // Send OTG Control (Clear/Set) register address
    LPC_USB->I2C_TX = 0x201;             // Set DP_PULLUP bit, send STOP condition
    while (!LPC_USB->I2C_STS & (1 << 0));
#endif
}


/*
 *  USB Reset Function
 *   Called automatically on USB Reset
 *    Return Value:    None
 */

void USB_Reset(void)
{
#if USB_DMA
    uint32_t n;
#endif

    LPC_USB->EpInd = 0;
    LPC_USB->MaxPSize = USB_MAX_PACKET0;
    LPC_USB->EpInd = 1;
    LPC_USB->MaxPSize = USB_MAX_PACKET0;
    while ((LPC_USB->DevIntSt & EP_RLZED_INT) == 0);

    LPC_USB->EpIntClr  = 0xFFFFFFFF;
    LPC_USB->EpIntEn   = 0xFFFFFFFF ^ USB_DMA_EP;
    LPC_USB->DevIntClr = 0xFFFFFFFF;
    LPC_USB->DevIntEn  = DEV_STAT_INT    | EP_SLOW_INT    |
                         (USB_SOF_EVENT   ? FRAME_INT : 0) |
                         (USB_ERROR_EVENT ? ERR_INT   : 0);

#if USB_DMA
    LPC_USB->UDCAH   = USB_RAM_ADR;
    LPC_USB->DMARClr = 0xFFFFFFFF;
    LPC_USB->EpDMADis  = 0xFFFFFFFF;
    LPC_USB->EpDMAEn   = USB_DMA_EP;
    LPC_USB->EoTIntClr = 0xFFFFFFFF;
    LPC_USB->NDDRIntClr = 0xFFFFFFFF;
    LPC_USB->SysErrIntClr = 0xFFFFFFFF;
    LPC_USB->DMAIntEn  = 0x00000007;
    DDMemMap[0] = 0x00000000;
    DDMemMap[1] = 0x00000000;
    for (n = 0; n < USB_EP_NUM; n++)
    {
        udca[n] = 0;
        UDCA[n] = 0;
    }
#endif
}


/*
 *  USB Suspend Function
 *   Called automatically on USB Suspend
 *    Return Value:    None
 */

void USB_Suspend(void)
{
    /* Performed by Hardware */
}


/*
 *  USB Resume Function
 *   Called automatically on USB Resume
 *    Return Value:    None
 */

void USB_Resume(void)
{
    /* Performed by Hardware */
}


/*
 *  USB Remote Wakeup Function
 *   Called automatically on USB Remote Wakeup
 *    Return Value:    None
 */

void USB_WakeUp(void)
{
    WrCmdDat(CMD_SET_DEV_STAT, DAT_WR_BYTE(DEV_CON));
}


/*
 *  USB Remote Wakeup Configuration Function
 *    Parameters:      cfg:   Enable/Disable
 *    Return Value:    None
 */

void USB_WakeUpCfg(uint32_t cfg)
{
    /* Not needed */
}


/*
 *  USB Set Address Function
 *    Parameters:      adr:   USB Address
 *    Return Value:    None
 */

void USB_SetAddress(uint32_t adr)
{
    WrCmdDat(CMD_SET_ADDR, DAT_WR_BYTE(DEV_EN | adr)); /* Don't wait for next */
    WrCmdDat(CMD_SET_ADDR, DAT_WR_BYTE(DEV_EN | adr)); /*  Setup Status Phase */
}


/*
 *  USB Configure Function
 *    Parameters:      cfg:   Configure/Deconfigure
 *    Return Value:    None
 */

void USB_Configure(uint32_t cfg)
{

    WrCmdDat(CMD_CFG_DEV, DAT_WR_BYTE(cfg ? CONF_DVICE : 0));

    LPC_USB->ReEp = 0x00000003;
    while ((LPC_USB->DevIntSt & EP_RLZED_INT) == 0);
    LPC_USB->DevIntClr = EP_RLZED_INT;
}


/*
 *  Configure USB Endpoint according to Descriptor
 *    Parameters:      pEPD:  Pointer to Endpoint Descriptor
 *    Return Value:    None
 */

void USB_ConfigEP(uep_desc_t pEPD)
{
    uint32_t num;

    num = EPAdr(pEPD->bEndpointAddress);
    LPC_USB->ReEp |= (1 << num);
    LPC_USB->EpInd = num;
    LPC_USB->MaxPSize = pEPD->wMaxPacketSize;
    while ((LPC_USB->DevIntSt & EP_RLZED_INT) == 0);
    LPC_USB->DevIntClr = EP_RLZED_INT;
}


/*
 *  Set Direction for USB Control Endpoint
 *    Parameters:      dir:   Out (dir == 0), In (dir <> 0)
 *    Return Value:    None
 */

void USB_DirCtrlEP(uint32_t dir)
{
    /* Not needed */
}


/*
 *  Enable USB Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USB_EnableEP(uint32_t EPNum)
{
    WrCmdDat(CMD_SET_EP_STAT(EPAdr(EPNum)), DAT_WR_BYTE(0));
}


/*
 *  Disable USB Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USB_DisableEP(uint32_t EPNum)
{
    WrCmdDat(CMD_SET_EP_STAT(EPAdr(EPNum)), DAT_WR_BYTE(EP_STAT_DA));
}


/*
 *  Reset USB Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USB_ResetEP(uint32_t EPNum)
{
    WrCmdDat(CMD_SET_EP_STAT(EPAdr(EPNum)), DAT_WR_BYTE(0));
}


/*
 *  Set Stall for USB Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USB_SetStallEP(uint32_t EPNum)
{
    WrCmdDat(CMD_SET_EP_STAT(EPAdr(EPNum)), DAT_WR_BYTE(EP_STAT_ST));
}


/*
 *  Clear Stall for USB Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USB_ClrStallEP(uint32_t EPNum)
{
    WrCmdDat(CMD_SET_EP_STAT(EPAdr(EPNum)), DAT_WR_BYTE(0));
}


