RT-Thread/realboard-lpc4088/software/rtthread_examples/drivers/usbhw.c
/*
 *  Clear USB Endpoint Buffer
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USB_ClearEPBuf(uint32_t EPNum)
{
    WrCmdEP(EPNum, CMD_CLR_BUF);
}


/*
 *  Read USB Endpoint Data
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *                     pData: Pointer to Data Buffer
 *    Return Value:    Number of bytes read
 */

uint32_t USB_ReadEP(uint32_t EPNum, uint8_t *pData)
{
    uint32_t cnt, n;

    LPC_USB->Ctrl = ((EPNum & 0x0F) << 2) | CTRL_RD_EN;

    do
    {
        cnt = LPC_USB->RxPLen;
    }
    while ((cnt & PKT_RDY) == 0);
    cnt &= PKT_LNGTH_MASK;

    for (n = 0; n < (cnt + 3) / 4; n++)
    {
        *((__packed uint32_t *)pData) = LPC_USB->RxData;
        pData += 4;
    }
    LPC_USB->Ctrl = 0;

    if (((EP_MSK_ISO >> EPNum) & 1) == 0)     /* Non-Isochronous Endpoint */
    {
        WrCmdEP(EPNum, CMD_CLR_BUF);
    }

    return (cnt);
}


/*
 *  Write USB Endpoint Data
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *                     pData: Pointer to Data Buffer
 *                     cnt:   Number of bytes to write
 *    Return Value:    Number of bytes written
 */

uint32_t USB_WriteEP(uint32_t EPNum, uint8_t *pData, uint32_t cnt)
{
    uint32_t n;

    LPC_USB->Ctrl = ((EPNum & 0x0F) << 2) | CTRL_WR_EN;

    LPC_USB->TxPLen = cnt;

    for (n = 0; n < (cnt + 3) / 4; n++)
    {
        LPC_USB->TxData = *((__packed uint32_t *)pData);
        pData += 4;
    }
    LPC_USB->Ctrl = 0;
    WrCmdEP(EPNum, CMD_VALID_BUF);
    return (cnt);
}

#if USB_DMA

/* DMA Descriptor Memory Layout */
const uint32_t DDAdr[2] = { DD_NISO_ADR, DD_ISO_ADR };
const uint32_t DDSz [2] = { 16,          20         };


/*
 *  Setup USB DMA Transfer for selected Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                     pDD: Pointer to DMA Descriptor
 *    Return Value:    TRUE - Success, FALSE - Error
 */

uint32_t USB_DMA_Setup(uint32_t EPNum, USB_DMA_DESCRIPTOR *pDD)
{
    uint32_t num, ptr, nxt, iso, n;
    uint32_t *tmp;

    iso = pDD->Cfg.Type.IsoEP;                /* Iso or Non-Iso Descriptor */
    num = EPAdr(EPNum);                       /* Endpoint's Physical Address */

    ptr = 0;                                  /* Current Descriptor */
    nxt = udca[num];                          /* Initial Descriptor */
    while (nxt)                               /* Go through Descriptor List */
    {
        ptr = nxt;                              /* Current Descriptor */
        if (!pDD->Cfg.Type.Link)                /* Check for Linked Descriptors */
        {
            n = (ptr - DDAdr[iso]) / DDSz[iso];   /* Descriptor Index */
            DDMemMap[iso] &= ~(1 << n);           /* Unmark Memory Usage */
        }
        nxt = *((uint32_t *)ptr);                  /* Next Descriptor */
    }

    for (n = 0; n < 32; n++)                  /* Search for available Memory */
    {
        if ((DDMemMap[iso] & (1 << n)) == 0)
        {
            break;                                /* Memory found */
        }
    }
    if (n == 32) return (FALSE);              /* Memory not available */

    DDMemMap[iso] |= 1 << n;                  /* Mark Memory Usage */
    nxt = DDAdr[iso] + n * DDSz[iso];         /* Next Descriptor */

    if (ptr && pDD->Cfg.Type.Link)
    {
        *((uint32_t *)(ptr + 0))  = nxt;           /* Link in new Descriptor */
        *((uint32_t *)(ptr + 4)) |= 0x00000004;    /* Next DD is Valid */
    }
    else
    {
        udca[num] = nxt;                        /* Save new Descriptor */
        UDCA[num] = nxt;                        /* Update UDCA in USB */
    }

    /* Fill in DMA Descriptor */
    //*(((uint32_t *)nxt)++) =  0;                 /* Next DD Pointer */
    tmp = (uint32_t *)nxt;
    *tmp++ = 0;
//  *(((uint32_t *)nxt)++) =  pDD->Cfg.Type.ATLE |
//                       (pDD->Cfg.Type.IsoEP << 4) |
//                       (pDD->MaxSize <<  5) |
//                       (pDD->BufLen  << 16);
    *tmp++ =  pDD->Cfg.Type.ATLE |
              (pDD->Cfg.Type.IsoEP << 4) |
              (pDD->MaxSize <<  5) |
              (pDD->BufLen  << 16);
//  *(((uint32_t *)nxt)++) =  pDD->BufAdr;
    *tmp++ =  pDD->BufAdr;
//  *(((uint32_t *)nxt)++) =  pDD->Cfg.Type.LenPos << 8;
    *tmp++ =  pDD->Cfg.Type.LenPos << 8;
    if (iso)
    {
//    *((uint32_t *)nxt) =  pDD->InfoAdr;
        *tmp =  pDD->InfoAdr;
    }

    return (TRUE); /* Success */
}


/*
 *  Enable USB DMA Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USB_DMA_Enable(uint32_t EPNum)
{
    LPC_USB->EpDMAEn = 1 << EPAdr(EPNum);
}


/*
 *  Disable USB DMA Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USB_DMA_Disable(uint32_t EPNum)
{
    LPC_USB->EpDMADis = 1 << EPAdr(EPNum);
}


/*
 *  Get USB DMA Endpoint Status
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    DMA Status
 */

uint32_t USB_DMA_Status(uint32_t EPNum)
{
    uint32_t ptr, val;

    ptr = UDCA[EPAdr(EPNum)];                 /* Current Descriptor */
    if (ptr == 0)
        return (USB_DMA_INVALID);

    val = *((uint32_t *)(ptr + 3 * 4));          /* Status Information */
    switch ((val >> 1) & 0x0F)
    {
    case 0x00:                              /* Not serviced */
        return (USB_DMA_IDLE);
    case 0x01:                              /* Being serviced */
        return (USB_DMA_BUSY);
    case 0x02:                              /* Normal Completition */
        return (USB_DMA_DONE);
    case 0x03:                              /* Data Under Run */
        return (USB_DMA_UNDER_RUN);
    case 0x08:                              /* Data Over Run */
        return (USB_DMA_OVER_RUN);
    case 0x09:                              /* System Error */
        return (USB_DMA_ERROR);
    }

