RT-Thread/realboard-lpc4088/software/rtthread_examples/drivers/usbhw.c
    return (USB_DMA_UNKNOWN);
}


/*
 *  Get USB DMA Endpoint Current Buffer Address
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    DMA Address (or -1 when DMA is Invalid)
 */

uint32_t USB_DMA_BufAdr(uint32_t EPNum)
{
    uint32_t ptr, val;

    ptr = UDCA[EPAdr(EPNum)];                 /* Current Descriptor */
    if (ptr == 0)
    {
        return ((uint32_t)(-1));                /* DMA Invalid */
    }

    val = *((uint32_t *)(ptr + 2 * 4));       /* Buffer Address */
    return (val);                             /* Current Address */
}


/*
 *  Get USB DMA Endpoint Current Buffer Count
 *   Number of transfered Bytes or Iso Packets
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    DMA Count (or -1 when DMA is Invalid)
 */

uint32_t USB_DMA_BufCnt(uint32_t EPNum)
{
    uint32_t ptr, val;

    ptr = UDCA[EPAdr(EPNum)];                 /* Current Descriptor */
    if (ptr == 0)
    {
        return ((uint32_t)(-1));                /* DMA Invalid */
    }
    val = *((uint32_t *)(ptr + 3 * 4));       /* Status Information */
    return (val >> 16);                       /* Current Count */
}


#endif /* USB_DMA */


/*
 *  Get USB Last Frame Number
 *    Parameters:      None
 *    Return Value:    Frame Number
 */

uint32_t USB_GetFrame(void)
{
    uint32_t val;

    WrCmd(CMD_RD_FRAME);
    val = RdCmdDat(DAT_RD_FRAME);
    val = val | (RdCmdDat(DAT_RD_FRAME) << 8);

    return (val);
}


/*
 *  USB Interrupt Service Routine
 */

void USB_IRQHandler(void)
{
    uint32_t disr, val, n, m;
    uint32_t episr, episrCur;

    disr = LPC_USB->DevIntSt;       /* Device Interrupt Status */

    /* Device Status Interrupt (Reset, Connect change, Suspend/Resume) */
    if (disr & DEV_STAT_INT)
    {
        LPC_USB->DevIntClr = DEV_STAT_INT;
        WrCmd(CMD_GET_DEV_STAT);
        val = RdCmdDat(DAT_GET_DEV_STAT);       /* Device Status */
        if (val & DEV_RST)                      /* Reset */
        {
            USB_Reset();
#if   USB_RESET_EVENT
            USB_Reset_Event();
#endif
        }
        if (val & DEV_CON_CH)                   /* Connect change */
        {
#if   USB_POWER_EVENT
            USB_Power_Event(val & DEV_CON);
#endif
        }
        if (val & DEV_SUS_CH)                   /* Suspend/Resume */
        {
            if (val & DEV_SUS)                    /* Suspend */
            {
                USB_Suspend();
#if     USB_SUSPEND_EVENT
                USB_Suspend_Event();
#endif
            }
            else                                  /* Resume */
            {
                USB_Resume();
#if     USB_RESUME_EVENT
                USB_Resume_Event();
#endif
            }
        }
        goto isr_end;
    }

#if USB_SOF_EVENT
    /* Start of Frame Interrupt */
    if (disr & FRAME_INT)
    {
        USB_SOF_Event();
    }
#endif

#if USB_ERROR_EVENT
    /* Error Interrupt */
    if (disr & ERR_INT)
    {
        WrCmd(CMD_RD_ERR_STAT);
        val = RdCmdDat(DAT_RD_ERR_STAT);
        USB_Error_Event(val);
    }
#endif

    /* Endpoint's Slow Interrupt */
    if (disr & EP_SLOW_INT)
    {
        episrCur = 0;
        episr    = LPC_USB->EpIntSt;
        for (n = 0; n < USB_EP_NUM; n++)        /* Check All Endpoints */
        {
            if (episr == episrCur) break;         /* break if all EP interrupts handled */
            if (episr & (1 << n))
            {
                episrCur |= (1 << n);
                m = n >> 1;

                LPC_USB->EpIntClr = (1 << n);
                while ((LPC_USB->DevIntSt & CDFULL_INT) == 0);
                val = LPC_USB->CmdData;

                if ((n & 1) == 0)                   /* OUT Endpoint */
                {
                    if (n == 0)                       /* Control OUT Endpoint */
                    {
                        if (val & EP_SEL_STP)           /* Setup Packet */
                        {
                            if (USB_P_EP[0])
                            {
                                USB_P_EP[0](USB_EVT_SETUP);
                                continue;
                            }
                        }
                    }
                    if (USB_P_EP[m])
                    {
                        USB_P_EP[m](USB_EVT_OUT);
                    }
                }
                else                                /* IN Endpoint */
                {
                    if (USB_P_EP[m])
                    {
                        USB_P_EP[m](USB_EVT_IN);
                    }
                }
            }
        }
        LPC_USB->DevIntClr = EP_SLOW_INT;
    }

#if USB_DMA

    if (LPC_USB->DMAIntSt & 0x00000001)            /* End of Transfer Interrupt */
    {
        val = LPC_USB->EoTIntSt;
        for (n = 2; n < USB_EP_NUM; n++)        /* Check All Endpoints */
        {
            if (val & (1 << n))
            {
                m = n >> 1;
                if ((n & 1) == 0)                   /* OUT Endpoint */
                {
                    if (USB_P_EP[m])
                    {
                        USB_P_EP[m](USB_EVT_OUT_DMA_EOT);
                    }
                }
                else                                /* IN Endpoint */
                {
                    if (USB_P_EP[m])
                    {
                        USB_P_EP[m](USB_EVT_IN_DMA_EOT);
                    }
                }
            }
        }
        LPC_USB->EoTIntClr = val;
    }

    if (LPC_USB->DMAIntSt & 0x00000002)            /* New DD Request Interrupt */
    {
        val = LPC_USB->NDDRIntSt;
        for (n = 2; n < USB_EP_NUM; n++)        /* Check All Endpoints */
        {
            if (val & (1 << n))
            {
                m = n >> 1;
                if ((n & 1) == 0)                   /* OUT Endpoint */
                {
                    if (USB_P_EP[m])
                    {
                        USB_P_EP[m](USB_EVT_OUT_DMA_NDR);
                    }
                }
                else                                /* IN Endpoint */
                {
                    if (USB_P_EP[m])
                    {
                        USB_P_EP[m](USB_EVT_IN_DMA_NDR);
                    }
                }
            }
        }
        LPC_USB->NDDRIntClr = val;
    }

    if (LPC_USB->DMAIntSt & 0x00000004)            /* System Error Interrupt */
    {
        val = LPC_USB->SysErrIntSt;
        for (n = 2; n < USB_EP_NUM; n++)        /* Check All Endpoints */
        {
            if (val & (1 << n))
            {
                m = n >> 1;
                if ((n & 1) == 0)                   /* OUT Endpoint */
                {
                    if (USB_P_EP[m])
                    {
                        USB_P_EP[m](USB_EVT_OUT_DMA_ERR);
                    }
                }
                else                                /* IN Endpoint */
                {
                    if (USB_P_EP[m])
                    {
                        USB_P_EP[m](USB_EVT_IN_DMA_ERR);
                    }
                }
            }
        }
        LPC_USB->SysErrIntClr = val;
    }

#endif /* USB_DMA */

isr_end:
    return;
}

#if defined   (  __IAR_SYSTEMS_ICC__  )
#pragma language=restore
#endif

/**
 * @}
 */
#endif /*_USB_DEV_MASS_STORAGE*/

